{"pages":[{"title":"404 Not Found 该页面不存在","text":"","link":"/404.html"},{"title":"关于我 About Me","text":"职业: 在校大学生 邮箱: liya.815@qq.com QQ: 3342147970 WeChat: LY3342147970 星座: 狮子座 语言: C/C++ IDE: VS Code 兴趣: 动漫，音乐，小说 运动: 睡觉 正在学习中的: vs code, C,C++","link":"/about/index.html"},{"title":"王炎教案","text":"","link":"/%E7%8E%8B%E7%82%8E%E6%95%99%E6%A1%88/index.html"}],"posts":[{"title":"教案","text":"王炎的教案文件 教学目标 了解现代诗歌的特点，正确划分诗的节奏，饱含深情地朗诵诗歌。 了解有关艾青的文学常识和本诗的写作背景。 学习有关象征的表现手法。 深刻领会诗歌所表达的思想感情。 教学重点 关键诗句的理解。 作者的思想感情。 本诗的主旨。 教学难点 象征的表现手法。 诗歌描写对象的象征意义。 教学方法 朗读教学法。 讨论法。 教学课时 两课时 教学步骤一、导入新课 土地，万物生灵的根基。曾有人掠夺它而百般蹂躏，曾有人捍卫它而披肝沥胆。在它的脊梁上演绎着多少可歌可泣的故事，在它的肌肤上烙印着多少眷恋情结。谁不钟爱自己的土地，谁不爱恋大地母亲，让我们深情吟唱艾青诗人的《我爱这土地》，随着诗中所迸发的爱国情感的火花而燃烧。（板书：我爱这土地） 二、作者简介 艾青（1910—1996），原名蒋海澄，浙江金华人，现代著名诗人。早期诗风格浑厚质朴，调子深沉忧郁。抗战时期的诗作，格调昂扬。建国后，作品思想更趋成熟，感情深沉，富于哲理。主要诗集有《大堰河》、《火把》等，成名作为《大堰河——我的保姆》。诗人曾自称为“悲哀的诗人”。在中国新诗发展史上，艾青是继郭沫若、闻一多等人之后又一位推动一代诗风，并产生过重大影响的诗人，在世界上也享有声誉，1985年，法国授予艾青文学艺术最高勋章。 三、背景介绍 本诗写于抗战初期的1938年，日本侵略军连续攻占了华北、华东、华南的广大地区，所到之处疯狂肆虐，妄图摧毁中国人民的抵抗意志。中国人民奋起反抗，进行了不屈不挠的斗争。诗人在国土沦丧、民族危亡的关头，满怀对祖国深沉的爱和对侵略者切齿的恨，写下了这首慷慨激昂的诗。四、朗读指导： 自由体的新诗，不同于旧体诗，字数、停顿、押韵没有严格的限制。随感情的表达句子可长可短，字数可多可少，自由灵活，不拘一格。因此，我们在读现代诗歌的时候，一定要把握好诗歌的节奏、停顿，轻重缓慢，抑扬顿挫，在反复朗读的基础上培养自己的语感，理解诗歌所描写的对象、运用的表现手法，更准确地领悟诗人所表达的思想感情，以读会意，以会意促读。词语的重读与否，主要是由诗歌的情感 所决定的。一般来说，能鲜明的表达出诗人情感的词语，包括中心语、修饰语，都应该重读。 第一步：听录音或教师范读； 第二步：用符号划分诗歌的停顿和重读的字词； 第三步：学生自由朗读； 第四步：推荐2—3名读的好的同学在班上朗读； 第五步：男生、女生分别齐读； 第六步：全班同学集体朗读； 第七步：背诵全诗。 合作探究一、学生在熟悉诗歌的基础上，紧扣“土地”，师生讨论分析全诗 点出土地情结。起始两句，诗人对土地的酷爱，已到了不知道如何倾诉的地步，于是他只能舍弃人的思维语言而借用鸟的简单朴素的语言倾泻他的感情。在诗人看来，这简单朴素的往往是最真诚热烈的，“嘶哑”的歌声正能抒发对土地的义无反顾的真诚和执着，于是土地情结的激越歌声由此响起。 倾吐土地情结。“被暴风雨所打击的土地”、“悲愤的河流”、“激怒的风”、“无比温柔的黎明”是作者所歌唱的对象，诗人没有沉溺于对“温柔”恬静的“黎明”的欣赏中，为了自己的爱永远留给土地，他作出了庄严郑重的选择。 升华土地情结。一问一答，诗人由借鸟抒情转入直抒胸臆。太“深沉”太强烈的土地情结，已使人难以诉诸语言，只能凝成晶莹的泪水。“深沉”一词也许表达不到与实际感情相适应的表达强度，于是其后紧跟的沉重的省略号，似乎涌动着潜流地火一般的激情，更为沉重地叩击着读者的心房，激起读者持续的共鸣。 揭示全诗主旨的诗句是什么？谈谈你的理解？ 回答：“为什么我的眼里常含泪水？因为我对这土地爱的深沉……”。 回答：这两句诗一问一答，直抒胸臆，以“我的眼里常含泪水”的情状，托出诗人那颗真挚炽热的爱国之心，形象地表达了诗人对土地的眷恋，而且隐含献身之意。 3、结合写作背景，准确理解“土地”、“河流”、“风”、“黎明”的象征意义。 回答：“土地”象征繁衍养育中华民族的祖国大地。“河流”、“风”象征中国人民不屈不挠的反抗精神。“黎明”象征充满生机与希望的解放区。 4、鸟儿歌唱的内容中，“土地”、“河流”、“风”的前面分别有“暴风雨所打击的”、“悲愤的”、“激怒的”这些修饰语，其作用是什么？ 回答：这些修饰语限定语丰富了意象的内涵 ，表明中华民族的祖国大地，在日本帝国主义的铁蹄下正遭受苦难，中国人民正满怀悲愤地进行不屈不挠的斗争。 5、诗人对土地、河流、风、黎明的描写，蕴含了他怎样的思想感情？ 回答：这些描写形象地表达了当时祖国大地遭受的苦难，人民的悲愤以及对光明的向往和希冀。 6.本文的写作特色： 1、意象内涵丰富（象征手法） 2、抒情方式巧妙 课堂小结学习完本篇文章我们了解到:作者运用象征手法，创造了一系列鲜明意象，抒发了对祖国真挚深沉的爱。板书设计我爱这土地","link":"/2022-05-04-%E6%95%99%E6%A1%88.html"},{"title":"Manacher 算法&&力扣 5.最长回文子串","text":"Manacher（马拉车） 算法，字符串匹配算法的一种。一般用于求最长回文子串。应用范围较窄。 算法例题力扣 5.最长回文子串给定一个字符串 s，找到 s 中最长的回文子串。你可以假设 s 的最大长度为 1000。 示例 1输入： “babad”输出： “bad”注意： “aba” 也是一个有效答案。 示例 2输入： “cbbd”输出： “bb” 算法原理及实现 Manacher 算法第一步：对原字符串 s 进行处理 Manacher 算法第二步：构造辅助数组 Manacher 算法第三步：根据辅助数组得出最长回文子串的下标元素长度等各项所需属性 第一步由于字符串 s 元素个数可能为奇数也可能为偶数，所以首先对原字符串 s 进行处理。在原字符串 s 中每两个相邻的之间加入一个间隔字符 “#” 并在字符串开头和结尾加入 “$” 间隔字符。 由此得出的字符串 s 一点是奇数个元素。 间隔字符无固定要求，只需于字符串元素无关即可。 第二步辅助数组的构造，运用中心扩散法，计算字符串 s 中，回文字符串的长度既以在数组 i 位置的元素为中心，计算 i+1 位置的元素和 i-1 位置的元素是否相等，若相等则计算 i+2 于 i-2 第三步由辅助数组得出最大的回文子串是下标为3和下标为5的两个元素 代码实现123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869char * longestPalindrome(char * s){ int i=0,id,maxid,ans=1,pos=0; //找到的最长回文串的左端下标 int left; //最长回文串的临时数组 char * result; //字符串长度 int str_length=strlen(s); //初始化新的数组,存放每个元素对应的回文半径 int p[2*str_length+3]; //构造新的字符数组，用来计算 char new_str[2*str_length+3]; new_str[0]='$'; new_str[1]='#'; for (i =0;i&lt; str_length;i++) { new_str[2*i+2]=s[i]; new_str[2*i+3]='#'; } new_str[2*str_length+2]='\\0'; int len = 2*str_length+2; // 对每个字符求其回文半径，利用前面的数组 // 最后面的'\\0'不用求 // 第一个字符\"$\"，p[0]=1 id = 0; maxid = 1; p[0] = 1; for (i=1;i&lt;len;i++) { // 判断前一次的回文最右端是不是包含当前判断的字符 if (maxid &gt; i) { p[i] = p[2*id-i] &gt; (maxid-i)?(maxid-i):p[2*id-i]; } else { p[i] = 1; } while(new_str[i+p[i]] == new_str[i-p[i]]) { p[i]++; } if(p[i]+i&gt; maxid) { maxid = p[i]+i; id = i; } if (ans&lt;p[i]) { ans = p[i]; pos = i; } } left = (pos-ans)/2; result = (char*)malloc(sizeof(char)*ans); for (i=0;i&lt;ans-1;i++) { result[i] = s[left+i]; } result[ans-1] = '\\0'; return result;}","link":"/2019-11-09-Manacher%E7%AE%97%E6%B3%95%E5%AE%9E%E7%8E%B0%E4%B8%8E%E5%8E%9F%E7%90%86.html"},{"title":"IDM修改注册表延长试用时长","text":"修改注册表具体方法如下 所需代码1234567891011121314151617181920212223242526272829303132333435363738394041424344Windows Registry Editor Version 5.00[-HKEY_CURRENT_USER\\Software\\Classes\\CLSID\\{7B8E9164-324D-4A2E-A46D-0165FB2000EC}][-HKEY_CURRENT_USER\\Software\\Classes\\Wow6432Node\\CLSID\\{7B8E9164-324D-4A2E-A46D-0165FB2000EC}][-HKEY_LOCAL_MACHINE\\Software\\Classes\\CLSID\\{7B8E9164-324D-4A2E-A46D-0165FB2000EC}][-HKEY_LOCAL_MACHINE\\Software\\Classes\\Wow6432Node\\CLSID\\{7B8E9164-324D-4A2E-A46D-0165FB2000EC}][-HKEY_CURRENT_USER\\Software\\Classes\\CLSID\\{6DDF00DB-1234-46EC-8356-27E7B2051192}][-HKEY_CURRENT_USER\\Software\\Classes\\Wow6432Node\\CLSID\\{6DDF00DB-1234-46EC-8356-27E7B2051192}][-HKEY_LOCAL_MACHINE\\Software\\Classes\\CLSID\\{6DDF00DB-1234-46EC-8356-27E7B2051192}][-HKEY_LOCAL_MACHINE\\Software\\Classes\\Wow6432Node\\CLSID\\{6DDF00DB-1234-46EC-8356-27E7B2051192}][-HKEY_CURRENT_USER\\Software\\Classes\\CLSID\\{D5B91409-A8CA-4973-9A0B-59F713D25671}][-HKEY_CURRENT_USER\\Software\\Classes\\Wow6432Node\\CLSID\\{D5B91409-A8CA-4973-9A0B-59F713D25671}][-HKEY_LOCAL_MACHINE\\Software\\Classes\\CLSID\\{D5B91409-A8CA-4973-9A0B-59F713D25671}][-HKEY_LOCAL_MACHINE\\Software\\Classes\\Wow6432Node\\CLSID\\{D5B91409-A8CA-4973-9A0B-59F713D25671}][-HKEY_CURRENT_USER\\Software\\Classes\\CLSID\\{5ED60779-4DE2-4E07-B862-974CA4FF2E9C}][-HKEY_CURRENT_USER\\Software\\Classes\\Wow6432Node\\CLSID\\{5ED60779-4DE2-4E07-B862-974CA4FF2E9C}][-HKEY_LOCAL_MACHINE\\Software\\Classes\\CLSID\\{5ED60779-4DE2-4E07-B862-974CA4FF2E9C}][-HKEY_LOCAL_MACHINE\\Software\\Classes\\Wow6432Node\\CLSID\\{5ED60779-4DE2-4E07-B862-974CA4FF2E9C}][-HKEY_CURRENT_USER\\Software\\Classes\\CLSID\\{07999AC3-058B-40BF-984F-69EB1E554CA7}][-HKEY_CURRENT_USER\\Software\\Classes\\Wow6432Node\\CLSID\\{07999AC3-058B-40BF-984F-69EB1E554CA7}][-HKEY_LOCAL_MACHINE\\Software\\Classes\\CLSID\\{07999AC3-058B-40BF-984F-69EB1E554CA7}][-HKEY_LOCAL_MACHINE\\Software\\Classes\\Wow6432Node\\CLSID\\{07999AC3-058B-40BF-984F-69EB1E554CA7}][HKEY_CURRENT_USER\\Software\\DownloadManager]&quot;FName&quot;=-&quot;LName&quot;=-&quot;Email&quot;=-&quot;Serial&quot;=-[HKEY_LOCAL_MACHINE\\Software\\Internet Download Manager]&quot;FName&quot;=-&quot;LName&quot;=-&quot;Email&quot;=-&quot;Serial&quot;=-[HKEY_LOCAL_MACHINE\\Software\\Wow6432Node\\Internet Download Manager]&quot;FName&quot;=-&quot;LName&quot;=-&quot;Email&quot;=-&quot;Serial&quot;=- 需进行的操作 打开记事本复制粘贴以上代码保存为 .reg 文件，文件名随意 双击打开运行，完成 IDM试用时间为30天，到期再次运行 注册表信息用法及含义注意，最后为一空行，不可省略。注册表的正确用法： 第一行为：Windows Registry Editor Version 5.00 第二行和最后一行均为空行 新建项：[路径\\新主键名] 删除项：[-路径\\主键名] 新建键值 或 修改键值[路径]“键名”=”键值” (针对字符串型键值)“键名”=hex:键值 (针对二进制型键值)“键名”=dword:键值 (针对DWORD键值) 删除键值：[路径]“键名”=- 注意主键路径大小写键值类型一律为小写在创建字符串类型的键值时，如果字符串中包含路径分隔符，这个路径分隔符应该加转义符即”\\“表示若键值名为”默认”，则键值名用”@”表示（没有引号）写完保存为*.reg文件然后双击导入即可，重启后可见效果 大概原理 当安装IDM时，应用程序会将安装程序安装时间保存在注册表里 当程序运行时会调取注册表内时间和电脑时间进行对比，如果 超出规定时间就禁止运行从这方面看，更改电脑时间也是可以延长使用时间的 不要想着卸载重装，一般来说删不干净的，注册表信息会保留 如果你手动删除的话也可以，注册表信息都是经过转义的，有字天书 本文内容整理自webkb","link":"/2019-12-07-%E4%BF%AE%E6%94%B9%E6%B3%A8%E5%86%8C%E8%A1%A8.html"},{"title":"教案10","text":"教案10蒹葭 教学目标1．了解《诗经》的基本知识及其在中国文学史上的地位，把握《诗经》赋比兴的艺术表现手法和章法的节奏特点。2．学习两首诗赋比兴的艺术表现手法，体会它的表达效果。3．体会两首诗大量运用重章叠句的表达方式，体会诗歌的音韵美、意境美、含蓄美。4．正确认识古代劳动人民对美好爱情的追求和向往。 教学重点 在诵读中体会诗的内涵。 把握诗中重章复唱的特点。 教学难点 正确理解诗中所表现的男女青年纯真美好的爱情。 品味诗歌的语言，准确把握诗中人物的情感。 一、新课导入金秋之季，拂晓之时；芦花泛白，清露为霜；瑟瑟秋风，苇丛起伏；茫茫秋水，清澈澄明。水上烟波万顷，空中雾霭迷蒙。弯曲的河道，水中的小洲，宛然在目。这是多么富有诗情画意的场景啊！这就是《诗经》中《蒹葭》一诗描绘的意境。根据著名作家琼瑶的作品《在水一方》改编的同名电视剧的主题歌《在水一方》就是根据《蒹葭》改写的。让我们唱着《在水一方》，一同品味《蒹葭》的朦胧缥缈。 二、作品介绍上节课我们已经了解了诗歌，大家还记得赋比兴和风雅颂都指的什么吗？ 三、朗读课文，梳清文意 教师范读 学生齐读 翻译课文，理解文意 四、合作探究整体感知 诗歌中哪一些诗句描写了景物？所写景物有怎样的特点？写景有什么作用？明确:“蒹葭苍苍，白露为霜”，描写了一幅秋苇苍苍、白露茫茫、寒霜浓重的凄清景色，造成了一种渺远迷茫的意境。渲染了气氛，烘托了人物忧郁感伤的情怀。 诗歌中哪些诗句表现了诗人渴慕伊人，历经艰险，执著追求，然而却求而不得的苦闷感伤情怀？明确:“溯洄从之，道阻且长。溯游从之，宛在水中央。溯洄从之，道阻且跻。溯游从之，宛在水中坻。溯洄从之，道阻且右。溯游从之。宛在水中沚。”这些诗句都表现了诗人渴慕伊人，历经艰险，执著追求，然而却求而不得的苦闷感伤情怀。“道阻且长”“道阻且跻”“道阻且右”说明爱的道路上困难重重，道路曲折艰险。然而尽管道路曲折艰险，诗人却仍然“溯洄从之”“溯游从之”，为了伊人，上下求索追寻，表达了诗人追求所爱的坚强意志。“宛在水中央”“宛在水中坻”“宛在水中沚”表达伊人在望，然而却可望而不可即的无限怅惘忧郁苦闷情怀。 这首诗的感情基调是怎样的？请说说你的理由。明确:这首诗的感情基调是渺远迷茫，忧郁缠绵，怅惘感伤。渴慕倾心于伊人，执著地追求，不怕道路的艰险，然而伊人却宛在水中央，如镜中花，水中月，可望而不可即，求而不得，故苦闷感伤忧郁。 (二)主旨探究《蒹葭》的主题是什么？[交流点拨]诗歌每一章前四句都是描写一种凄清而苍凉的景色，这种景色衬托出人物心中的空虚、惆怅之情；而后四句写出诗人对“伊人”的上下寻求，却又寻而不见的情景，这当中既有诗人的怅惘之情，又有诗人对伊人的深切思念。 (三)写法探究 《蒹葭》这首诗歌中运用了景物描写，这些景物描写在诗中起到了什么作用？明确:诗歌开篇便向读者展示了一个凄清的画面：一个晚秋的早晨，天色朦胧，笼罩在晨雾中的是一望无际的沾带露珠的芦苇。一条河流，蜿蜒而去。望远处，是一块小小的沙洲。这是一幅萧瑟的晚秋晨光图，烘托出主人公凄恻的情感。诗的每章景物描写都有不同。首章“白露为霜”，露凝为霜，是拂晓时；第二章“白露未晞”，太阳露面，天已大亮；末章“白露未已”，阳光照射，露水快干。三幅不同时间的晚秋晨光图，渲染烘托出主人公久久伫立远望而始终不能见面的惆怅心情，而主人公的这种心情随着晨光画面的重叠，显得越来越急切，越来越凄婉，使这首诗在艺术上达到了情景交融的境界。 这首诗采用重章叠咏的手法有什么好处？ 明确:回旋反复，可以增强诗歌的音乐感和节奏感，更充分地抒发情感。《蒹葭》全篇3章12句，只变动了十几个字，不但写出了芦苇茂盛的状态，爱情道路的曲折绵长，伊人虽近在咫尺，但又遥不可及的痛苦心情，而且通过不断重复的旋律，表现出诗人对爱情的执著追求，似乎有一种合唱、轮唱的味道。 课堂小结学习完《诗经》的这两首诗，大家课下可以比较下这两首诗有什么特点，作为一个作业，下节课提问布置作业背诵课文比较两首诗对爱情描绘的不同 板书设计蒹葭苍苍 水中央萋萋 水中坻采采 水中沚","link":"/2022-05-04-%E6%95%99%E6%A1%8810.html"},{"title":"教案2乡愁","text":"知识与能力 品味诗歌语言，了解诗人的情感。 了解诗歌的写作顺序和感情线索。 过程与方法 培养学生自主、合作、探究学习的能力。 反复诵读，使学生掌握诵读诗歌的要领和技巧。 提高学生欣赏诗歌的能力。３、情感态度价值观价值： 体味诗人所表达的乡愁，增强爱家乡、爱祖国的思想感情。 【教学重点难点】 重点、在朗读中感知《乡愁》的意境和情感。 难点：培养学生联想、想象思维和运用诗歌来表达情感的能力。 【教学方法】朗读法、启发法、探究法。 一、导入同学们，从小到大，你们离开过爸爸妈妈吗？当离家三五天，或半个月的时候，你们回想家吗？我们想家时，还可以常回家看看，可是那些远离祖国，漂泊在异乡的游子，特别是台湾同胞，因海峡两隔，长期不能见到亲人们，那才是真正的愁，真正的痛啊！现在，让我们一起走进诗人余光中那浓浓的《乡愁》世界，一起来倾听诗人内心的呼唤。 二、作者简介 余光中，台湾学者，１９２８年出生于南京。祖籍福建永春。１９４９年去台湾，是当代台湾著名诗人、散文家、学者。 三、朗读，整体感知 听录音磁带范读课文，注意感情基调、语速、节奏、重读。 指定学生诵读全诗，看谁读得好，教师作简要点评。 全班齐读。通过刚才同学们的深情朗读，我们体味到了这首诗有如音乐中柔美而略带哀伤的“回忆曲”，是海外游子深情而优美的恋歌。 四、小组讨论 从哪些词语可以看出，乡愁萦绕了诗人一生？小时候、长大后、后来、现在。 教师小结四个时间序词代表了四个人生阶段，概括了诗人整个人生，浓浓的乡愁牵动了诗人的一生。 ２、四个时间序词，代表了哪四个人生阶段？四个人生阶段又因什么而愁？小时候（少年）──母子分别 家愁（亲情）长大后（青年）──夫妻离愁 家愁（爱情）后来（中年） ──丧母哀愁 家愁（亲情）现在（老年） ──思归浓愁 国愁（祖国情） ３、乡愁本是非常抽象、不可捉摸的一种情感，诗人又是通过什么具体可感的形象来表达的？邮票──写信可寄家愁船票──乘船可解相思坟墓──生死隔绝，哀思难诉海峡──海水无尽，忧思无尽小结：这首诗，诗人借助四个意象，通过四个时段和空间的变化，逐层推进，抒发了自己浓浓的乡愁，子思母念，乡愁可人；夫妻爱恋，乡愁动人；祭母奠土，乡愁感人；愁绪祖国，着笔惊人！所以，读《乡愁》这首诗，我们能感到诗人余光中心灵深处一个执著的主导情感不仅仅是乡愁，还有对对中华民族历史文化的认同感。 4、这首诗诗人借用了“邮票、船票、坟墓、海峡”这些形象具体的事物来表达看不见、摸不着的抽象的乡愁离绪。其实呢，除了这些形象的事物，还有很多物象能触动你心中的痛，触发你的情感，引起你的愁绪。请你以“乡愁是……”为乡愁打个比方。例：乡愁是一根长长的电话线。乡愁是一封小小的 E-mail。 乡愁是一缕轻烟，缭绕在游子心头。 5、“乡愁”应该是一样很有份量的感情。同学们找找看诗歌中形象的前面都用了哪些修饰语，它们有着什么样的特点，它们又突出了四样东西的什么特征？在诗中有着什么表达效果？ “一枚”“一张”“一方”“一湾”四个数量词和“小小的”“窄窄的”“矮矮的”“浅浅的”四个形容词都以一种看似轻描淡写的方式，把乡愁浓缩于四个面积小程度轻的对象之上，恰恰反衬出诗人内心深处浓烈的思乡情感。 六、课堂小结同学们“乡愁”是我国传统文学历久常新的主题，古诗中有许多象余光中的这首“乡愁”诗，无论是内容还是形式，都映射着中国古典诗词的神韵和魅力。最后，让我们一齐来吟诵这首深情的恋歌，再一次体会诗人内心涌动的思乡爱国情感。 七、布置作业 背诵《乡愁》。 以“爱家乡”为话题写一篇作文，文体不限","link":"/2022-05-04-%E6%95%99%E6%A1%882%E4%B9%A1%E6%84%81.html"},{"title":"教案5","text":"教案5生于忧患死于安乐 教学目标 理解词语举、空乏、拂、所以、曾益、恒过、作、征、喻、恒的含义。 学习古人说理论证的方法，品味对比、排比等修辞手法的表达效果。 理解“生于忧患，死于安乐”的含义，从中得到教益，增强忧患意识。 教学难点 学习古人说理论证的方法，品味对比、排比等修辞手法的表达效果。 理解“生于忧患，死于安乐”的含义，从中得到教益，增强忧患意识。 教学时数：2课时教学过程一、 导入新课大家都熟悉“卧薪尝胆”的故事吧。越王勾践在患难中矢志不渝，终于打败了吴国，重振越国;然而在此以后，“越王勾践破吴归，战士还家尽锦衣。宫女如花满春殿，只今惟有鹧鸪飞”。沉溺于安乐中的越王重蹈覆辙。越王勾践的经历给我们什么样的启示呢? 二、资料简介孟子与《孟子》孟子(公元前372～公元前289)，邹人，是孔子之孙孔仅的再传弟子。游说于齐梁之间，没有被重用，退而与其门徒公孙丑、万章等著书立说。继承孔子的’学说，兼言仁和义，提出“仁政”的口号，主张恢复“井田制”和世卿制度，同时又主张“民为贵”君为轻”，称暴君为“一夫”，认为人性本善，强调养心、存心等内心修养的工夫，成为宋代理学家心性学之本。宋元以后，地位日尊，元至顺元年封为邹国亚圣公，明嘉靖九年定为“亚圣孟子”，在儒家中其地位仅次于孔子。思想事迹大都见于《孟子》一书。 三、初读课文，整体感知 学生自读课文。要求读准字音，读出停顿，读出抑扬顿挫的气势和美感。 学生齐读课文。 学生个别朗读课文。读准下面加点字的读音：(1)舜/发于/畎亩之中，傅说/举于/版筑之间，胶鬲/举于/鱼盐之中，管夷吾/举于/士，孙叔敖/举于/海，百里奚/举于/市。(2)……必先苦/其心志，劳/其筋骨，饿/其体肤，空乏/其身，行拂/乱/其所为，所以动心/忍性，曾益/其所不能 四、再读课文，理解课文 学生自读课文，结合注释，借助工具书翻译课文。 小组交流，讨论，解答翻译中的疑难问题。 五、分析课文内容 本文的中心论点是什么?作者是从哪两个方面论证的?请简述本文的论证思路。 本文的中心论点是“生于忧患，死于安乐”。作者从个人、国家两方面论证。文章先谈造就人才的问题。先以六个出身低微、经过种种磨炼而终于身负“大任”的显贵人物为例来说明人才是在艰苦环境中造就的，同时又重视人的主观因素，提出“困于心，衡于虑，而后作”的观点。从两方面说明人要有所作为，成就大业，就必须在生活、思想、行为等方面经受一番艰难甚至痛苦的磨炼。接着由个人说到国家，指出决定国家存亡的因素和个人能否成就大业的因素相仿，最后推出论点。 这篇文章在论证方法上有什么特色? 这篇短论采用了类比论证、举例论证、对比论证、等论证方法。如把造就人才与治理国家类比，如六位逆境中成才的人物事例罗列，如把成就伟人与国家灭亡对比，如先分析论证，后归纳观点等等。学习完两篇文章，相信大家可以看到孟子所做文章，句式工整，表意蕴藉。闪烁着哲理的光华。同学们可以谈谈学习了《生于忧患，死于安乐》，你获得了怎样的启示，老师来布置个作业。 六、布置作业写一篇读后感。谈谈在物质生活日渐丰裕的今天，该如何认识“生于忧患.死于安乐”。","link":"/2022-05-04-%E6%95%99%E6%A1%885.html"},{"title":"教案6","text":"教案6得道多助失道寡助 教学目标知识与技能 积累文言知识，掌握古今异义词及词性活用等现象。 了解《孟子》散文的特点，理解孟子的政治主张。 背诵短文，积累名言警句。 过程与方法 反复诵读，理解文意，培养学生文言文自学能力。 学习古人说理论证的方法，品味对比、排比等修辞的表达效果。 情感态度与价值观 理解“天时”地利”“人和”与“得道多助”失道寡助”，增强对国家安定团结的政治局面的认识 教学重点理清论证思路，把握说理方法。 教学难点正确认识“得道多助”的时代意义。 教学方法 诵读法 讨论点拨法 中国有句俗话：得民心者得天下。在中国历，得民心者得天下的君主同学们能列举处几位呢?孟子一生满腹经纶，不在其位而谋“仁政”，展现出他以天下为己任的博大胸怀。今天，让我们一起来学习孟子的《得道多助，失道寡助》这篇文章，让大家了解一种能够克敌制胜的方法。 二、 资料助读(多媒体展示)孟子(公元前372～公元前289)，名轲，思想家，教育家，是继孔子以后儒家学派的代表人物，与孔子合称“孔孟”，并有“亚圣”之称。《孟子》是儒家学派的经典著作之一，记述了孟子的言行、政治主张、哲学主张及哲学、_、教育思想等学术问题的论争。全书共七篇，分《梁惠王》《公孙丑》《滕文公》《离娄》《万章》《告子》《尽心》7篇，计261章，约35000字。。内容包括孟子的言行、政治学说以及哲学、_、教育思想等学术问题的论争。《孟子》在先秦诸子散文中独具风格，对后世散文的发展有着很大的影响。 师播放示范朗读磁带，学生听读，注意把握字音、停顿、重音。 教师示范背读课文，注意读出文章的气势。 学生齐读课文，教师稍作朗读指导。注意排比句的节奏：如：域民/不以/封疆之界，固国/不以/山溪之险，威天下/不以/兵革之利。得道者/多助，失道者/寡助。寡助/之至，亲戚/畔之。多助/之至，天下顺之 本文的中心论点是什么？文章是如何逐层展开论证的？中心论点是“天时不如地利，地利不如人和”。文章开篇提出论点，指出人和是克敌制胜的首要条件，由此逐层展开，用概括性的战例加以证明，分别就天时与地利、地利与人和作比较，指出天时、地利、人和三因素在战争中所起的作用不同；然后由战争中的“人和”推出治国安邦的道理，得出“得道多助，失道寡助”的结论，阐明了“人和”结果是“多助”“天下顺之”；最后把“多助”与“寡助”进行对比，自然导出“得道者多助，失道者寡助”的结论。课文论证方式如下：中心论点：天时不如地利，地利不如人和。↓论证：战例一(攻方失利)天时不如地利。战例二(守方失利)地利不如人和。↓总结：得出主旨：得道者多助，失道者寡助。 教师释疑、点拨(1)重点讲解下列词语及句子。 “三里之城，七里之郭”：古代城邑有内外城之分，“城”为内城，“郭”为外城；“三里”、“七里”均非实指，说明城邑之小。“是天时不如地利也”一句中的“是”，作代词用，即“这(就是)”的意思，与“也”合用，构成判断句，意思是“这就是……的道理”。“人和”：指人心所向，上下团结等。“域民”：“域”，界限，可解释为“限制”，名词作动词。“固国”：“固”，原为形容词，这里用作动词，“使国巩固”。“威天下”：“威”，原为形容词，这里用作动词，作“震慑”讲。“寡助之至”：“之”，动词，作“到”讲。“畔”：“叛”的通假字，背叛。“故”：承接上文，引起下文。可解释为“所以……”。“人和”与下文所说的“道”是什么关系？ “道”即指仁政。“得道”就是施行仁政。施行仁政则“多助”，“多助”则“天下顺之”，这就是“人和”，即得到人民的支持和拥护。5．文章的“城非不高也……米粟非不多也”运用什么句式？有什么效果？运用双重否定的排比句，起肯定、加强语言气势的作用，极言防御一方地理条件的优越。 6．文章“域民不以封疆之界……威天下不以兵革之利”运用什么句式？将“得道者”与“失道者”作比较有什么效果？①运用排比句，再次强调“地利”不足恃。②运用对比手法，把“得道者”与“失道者”的后果进行对比，点明文章主旨。 7．中心论点既然已得到了论证的情况下，为什么还要写“故曰，战必胜矣”？这样写的作用是在前面论述的基础上的进一步阐述，将论点的范围由战争推及到治国，从而全面体现孟子的政治主张，使文章更具有普遍意义。其次，“得道”实际上也可理解为“得人心”，即“人和”。得人心者，人心归顺，所向披靡；失人心者，人心相悖，不攻自溃。因而，最后一句绝非多余的闲笔。 8．注意下列词语的作用：“故曰”，在文章中起承接作用。“故”一笔概括了前面文字，“曰”总领发起下文议论。“君子”，即文章中所说“得道者”。归纳：从“故曰”到“战必胜矣”进一步论证“得道多助，失道寡助”的道理。 9．这篇短文在论证方法上有什么特色？主要体现在两个方面：(1)逐层论证，层层深入。文章第1句，开门见山提出中心论点，接着引用战例，分别论证了“天时不如地利”“地利不如人和”，突出了“人和”的重要；下文进一步阐发、说明，欲得“人和”，必先要“得道”。全文紧紧围绕着“人和”这一中心，环环相扣，逐层推理，显示出极其严密的论证艺术和极强的逻辑性。(2)议论中运用排比、对比等手法，使文章气势恢弘、笔酣墨畅、结构缜密。 小结《得道多助，失道寡助》通过对天时、地利、人和三个条件的比较，说明决定战争胜负的根本条件是人心的向背，而决定人心向背的是是否施行“仁政”，从而阐明施行“仁政”的必要性。 布置作业谈谈你对得道多助失道寡助的理解","link":"/2022-05-04-%E6%95%99%E6%A1%886.html"},{"title":"教案4","text":"教案4祖国啊 教学目标 初步了解中国新诗中朦胧诗的特点。 理解诗中的艺术形象，体会诗中蕴涵的深沉而真挚的情感。 培养学生解读诗歌的能力，激发爱国、为国献身的精神。 教学重点 有感情地诵读这首诗。 把握诗中富有特征的意象。 教学难点 朦胧诗的特点。 诗中“我”的形象。 诗中对祖国的感情抒发。 教学过程一、导入同学们，我们来听一首歌，殷秀梅的《祖国，我永远热爱您》。（目的：将同学们带入意境）。每一位有血有肉的中国人，都有一颗拳拳的赤子之心，这颗心与祖国的荣辱紧密相连。无数文人墨客，用饱蘸深情的墨笔，写下了一首首令人荡气回肠的诗，舒婷就是一位代表诗人，今天，我们共同走进她的《祖国啊，我亲爱的祖国》。（板书课题和作者） 二、简介简介作者及背景舒婷，当代女诗人，福建省泉州市人，1952年出生在厦门，由于家庭的破裂使她过早体味到社会的动荡，人世的沧桑。70年代末，她的诗就受到人们的关注，作为朦胧诗的代表人物一举闻名。代表作有诗集《双桅船》《舒婷顾城抒情诗选》《会唱歌的鸢尾花》等。 三、分析诗歌 听读配乐诗朗诵《祖国啊，我亲爱的祖国》，整体感知诗的意境，并注意字的读音。 学生自由朗读，注意节拍、重音和感情。3.研析诗的内容。全诗共分四节。方法：（1）反复诵读，概括出每一节诗的内容。（2）在读中体会句式特点和作者的感情。第一节：诗人排列了一系列具体的意象：水车、矿灯、稻穗、路基、驳船。在这些意象的前面分别加了“破旧、熏黑、干瘪、失修”等修饰词，显示出祖国的贫瘠与破败，以第一人称的形式深情地向祖国诉说着“我”与祖国生死相依患难与共的情感。第二节：运用“贫穷、悲哀、希望”等抽象的词语，宗教中传说的“飞天”神，写出人们在痛苦的境遇中饱含着“希望”。第三节：“簇新的理想、古莲的胚芽”等，写出祖国正孕育着新生。表达了诗人对未来的憧憬。第四节：写出“我”与祖国再次融为一体，个体上，“我”是祖国的“十亿分之一”，使命上，“我”要承担祖国振兴的责任。祖国含辛茹苦养育了“我”，“我要用我的血肉之躯去取得你的富饶、你的荣光、你的自由”。 四、难点解析 什么是朦胧诗。“朦胧诗”是采用虚写手法，变具体为抽象，追求的是诗内在旋律，运用象征和隐喻的写法，使人读起来有一种朦胧的美感。（学生再次朗读）。 对诗中“我”的形象理解：诗中“我是……我是你……”的句式反复出现，表明“我”与祖国用着共同命运，一同经历沧桑风雨，生死相依，血肉相连。我是诗人。“我”的形象融入到祖国的形象中。 我从‘数百年纺着疲惫的歌的河边上的破旧的老水车、在历史的隧洞中蜗行摸索的熏黑的矿灯，’这些意象中看出历史的祖国是贫穷、落后、发展缓慢艰难（特征）的，抒发了诗人悲哀叹息的情感。” (第一节，百年贫穷—悲哀；第二节，有希望从未实现—-无奈；第三节，重获希望—-激动兴奋；第四节，甘愿现身—-坚定慷慨。) （此处让同学在理解诗人情感后再读，分析前后读的变化，理解诗的朗读应带上感情。） 教师小结 不论是历史中贫穷落后的祖国，还是现时期崭新而充满希望的祖国，还是未来富饶、荣光、自由的祖国；不论是诗人的悲哀、无奈，还是兴奋激动、坚定要为祖国献身的意志，都包含了诗人对祖国无比深沉炽热的热爱之情，情感由低回叹息到激昂热烈，富有变化美，而诗人对祖国生死相依，甘愿现身的赤诚的情感更美。可在整首诗中，诗人并未出现一个“爱”字，这浓厚的情感又是如何传达出来的呢？（介绍朦胧诗）学生尝试分析","link":"/2022-05-04-%E6%95%99%E6%A1%884.html"},{"title":"教案7","text":"教案7惠子相梁 教学目标知识与能力目标 走近庄子，了解《庄子》及庄子的生平和思想。 积累文言常识，提高阅读浅显文言文的能力。 学习寓言所阐明的道理。 过程与方法目标以“读”为主线，按“通读——朗诵——诵读”层进式推进课堂流程，在教学中“以生为本”，充分体现自主性原则，让学生自行预习，自行搜索资料、自行朗读、自行体验揣摩，自行质疑讨论，师生平等对话。 情感态度与价值观目标拓宽学生的阅读视野，增加他们对传统文化经典的了解，提高文化品位。 教学重点难点 引导学生通过课前预习和课堂的练习，理解课文内容。 进行文言文基础知识学习和积累。 学习寓言所阐明的道理和其中所折射出的庄子的道家思想。 教学课时：一课时教学步骤及内容一、导入新课春秋战国时期，正是中国社会形态从奴隶社会向封建社会过渡的阶段，当时诸侯争霸，战事频繁，政局动荡。生逢乱世的先贤圣哲们，或是奔走呼吁宣扬自己的治国策略；或是著书立说表达自己的处世哲学，于是给后世传下了蔚为大观的先秦诸子散文。虽然历经了两千多年的斗转星移，但是先秦诸子散文绝对是中国文学史上熠熠生辉，光照千秋的的璀灿恒星。而传承中华文明，是我们每一位中国人义不容辞的责任。所以我们已经陆续学习了诸子散文中的代表作品如《论语》、《墨子》、《孟子》，今天就让我们再走近庄子，让我们一起去感受他睿智机敏、诙谐幽默的大家风范吧！ 二、介绍作者庄子（约公元的369～公元前286），名周，战国时宋国蒙人，我国古代著名的思想家（哲学家）、文学家。道家学派的代表人物之一。庄子生活在一个社会矛盾极其尖锐的时代，做过漆园吏。他不满现实，不与统治阶级合作，据传楚王曾以千金相邀为相，被其拒绝。庄子对后人的影响主要是《庄子》一书。 三、疏通理解文意，探究寓意（一）读顺读懂，培养语感，翻译积累 学生自由大声朗读课文，注意其中较难字读音。 全班齐读课文。 借助课文注释和工具翻译，教师翻译。 句子翻译重点词语检测。 1.文本细读，赏析字词惠子相梁，庄子往见之。或谓惠子曰：“庄子来，欲代子相。”于是惠子恐，搜于国中三日三夜。赏析惠子的心态 “恐”。把这个“搜”换成找行不行？明确：恐惧什么，怎样恐惧？“庄子来，欲代子相。”内心的不自信，对庄子的才能的嫉妒。就比如“搜”比找的意义更重，细致，兴师动众，紧张。 2.庄子给惠子讲故事的目的是什么呢？明确:借鹓鶵和鸱的故事，“今子欲以子之梁国而吓我邪？”骂惠子是个小心眼，怀疑、不信任朋友；小肚鸡肠，利欲熏心，薄情寡义的人。以小人之心度君子之腹。骂惠子的同时，表明自己的志趣追求。不慕名利，不贪荣华。 3故事体裁。这故事就是寓言故事寓言作文文学体裁的一种，是含有讽喻或明显教训意义的故事。大道理蕴含于小故事中，文本本身就是一个故事。 4.庄子寓言的魅力明确： 嬉笑怒骂，辛辣讽刺 想象丰富，言简意赅推荐阅读《庄子》中的“东施效颦””“井底之蛙”原文，多多感受庄子的语言魅力。 四、小组讨论，初步了解庄子人生志趣以“惠子相梁”为例，理解庄子的人生志趣。 学生讨论明确庄子清高自守，视爵禄如“腐鼠”， 鄙视功名富贵，应一切顺其自然。心境旷达，视荣华富贵如敝屣，他有着高雅的生活情趣和完美的理想追求。 教师总结本钱课文人物形象生动，寓言故事耐人寻味，如甘醴似琼浆，让人百品不厌。尝试背诵全文。 五、布置作业 背诵全文。 写作以惠子为“我”，第一人称再叙故事。","link":"/2022-05-04-%E6%95%99%E6%A1%887.html"},{"title":"教案8","text":"教案8庄子与惠子 教学目标 反复诵读，培养文言语感，正确把握文章节奏，体会辩论之趣，感受二人日常生活中的诗意； 比较庄子与惠子在思想、性格、气质等方面的差异，理解庄子的基本观点,体会庄子面对生活的从容、智慧。 教学重点体会辩论之趣，感受二人日常生活中的诗意；比较庄子与惠子在思想、性格、气质等方面的差异，体会庄子面对生活的从容、智慧。 教学难点比较庄子与惠子在思想、性格、气质等方面的差异。体会庄子面对生活的从容，智慧。 一、课堂导入我们已经学习了《庄子》二则中的第一则《北冥有鱼》，请根据你的理解说一说庄子是一位怎样的人？明确:他身处战国，是楚庄王后裔 他做过漆园小吏，以编草鞋为生 他以寓言传道他被唐玄宗下诏尊为“南华真人” 他主张“天人合一”、“道法自然” 他是——道家学说的集大成者 （一）初读，正字音 教师朗读之后学生练读，注意读准字音 全班齐读课文，纠正字音 （二）再读，划节奏《庄子与惠子游于濠梁之上》主要由庄子与惠子的对话构成，二人反复辩难，最后几近说绕口令，所以很多学生无法正确划分节奏，于是设计以下环节。 自己练读，注意把握节奏 小组交流练读，解决问题； 小组展示朗读，师生互评。 方法点拨：这篇文章是人物的对答，注意读出对答的语气。 （三）译读，知文意自己借助文章注释翻译，然后小组内译读，解决不懂的字词，每个小组推荐一名同学翻译。 （四）趣读，体会辩论之趣 小组合作探究：比较庄子与惠子在思想、性格、气质等方面的差异。方法点拨：注意二人所关注的对象和说话的技巧。大家把自己带入到文章中， 入情入境，我即庄子、我即惠子。同桌分别扮演庄子和惠子，演读这场辩论。方法点拨：根据自己的理解用你的方式有感情的演读，可以根据需要适当增加语言和动作，助于表情达意。 同桌分别扮演不同角色，根据自己的理解，有感情的朗读。 展示朗读，并简要说明为什么这样读？ 明确： 惠子好辩，重分析。对于事物有一种寻根究底的认知态度，重在知识的探讨。 庄子智辩，重观赏，对于外界的认识，带有欣赏的态度，将主观的情意发挥到外物上而产生移情同感的作用。 如果说惠子带有逻辑家的个性，那么庄子则具有艺术家的风貌。庄子与惠子的关系如何?庄子与惠子关系如何惠子死后，庄子再也找不到可以对谈的人了。在这短短的寓言中，流露出纯厚真挚之情。所以，两人的辩论，一力辩，一巧辩；一求真，一尚美；一拘泥，一超然。辩论轻松、闲适，让人感受到日常生活中的诗意。 小结 让我们带着惠子的那份咄咄逼人、寻根究底，庄子的那份悠然、从容，再次朗读课文，体会庄子面对生活的从容、悠然、智慧，再次读一遍课文，读完大家可以下课。 布置作业背诵课文完成课后小题三","link":"/2022-05-04-%E6%95%99%E6%A1%888.html"},{"title":"教案9","text":"教案9关关雎鸠 教学目标 了解《诗经》的基本知识及其在中国文学史上的地位，把握《诗经》赋比兴的艺术表现手法和章法的节奏特点。 学习两首诗赋比兴的艺术表现手法，体会它的表达效果。 体会两首诗大量运用重章叠句的表达方式，体会诗歌的音韵美、意境美、含蓄美。 正确认识古代劳动人民对美好爱情的追求和向往。 教学重点 在诵读中体会诗的内涵。 把握诗中重章复唱的特点。 教学难点 正确理解诗中所表现的男女青年纯真美好的爱情。 品味诗歌的语言，准确把握诗中人物的情感。 一、新课导入雎鸠啼鸣，荇菜参差，琴瑟钟鼓，君子淑女……这一切，在心中荡漾着爱意的恋人眼中，大概会多一层温馨与幽怨吧！你听，他们各自为自己倾心的“淑女”唱出了缠绵悱恻的情歌。今天，我们一起走近冠于《诗经》之首的《关雎》。二、《诗经》简介《诗经》是我国最早的一部诗歌总集，本来只称《诗》，后来被儒家奉为经典，改称《诗经》。收录了从西周初年到春秋中叶约五百年间的诗歌305篇，也称“诗三百”。《诗经》分为“风”“雅”“颂”三大类。“风”又叫“国风”“十五国风”，共160篇，为当时15个王国的土风民谣。风格清新质朴，民歌情调浓厚，多出自下层人民之手。“雅”是周朝直接统治地区的音乐。分为“大雅”和“小雅”，主要用于统治者的朝会宴享，以歌功颂德为主；“颂”是统治者用于宗庙祭祀的舞乐，内容以颂扬为主。《诗经》大多数作品是作者以自己的生活为素材，进行具体逼真的表现，很少有幻想、夸张的内容，“饥者歌其食，劳者歌其事”。其基本表现手法为“赋、比、兴”。“赋”：铺陈直叙的意思。“比”：就是比喻，对人或事物加以形象的比喻，使其特征更加鲜明突出。“兴”：借助其他事物作为诗歌的发端，以引起所要歌唱的内容。《诗经》的诗体格式以四言为主，兼有杂言，时而重章叠句、反复咏唱。其语言生动传神，并时常运用叠字、双声、叠韵等修辞手法。 三、朗读课文，梳清文意 教师范读 学生齐读 翻译课文，理解文意 合作探究 这首诗讲了一个什么故事？请同学们用自己的语言来描述。明确:写了一个男子对一位美丽少女的相思之情，求而不得，他日思夜想，辗转反侧，夜不能寐。他做梦梦见自己弹琴奏瑟，迎娶这位姑娘。 这首诗是如何抒发相思之情的？请具体分析。明确:首章四句写一个青年小伙子见到河洲上一对水鸟的相亲相爱，听到它们一唱一和的鸣叫，自然产生无限情思，因为他心目中正有着一位所爱的人儿呢！他向往着那位美丽贤淑的好姑娘能够成为自己理想的配偶。第二章八句写他日夜相思，须臾不能忘怀这位采荇菜的姑娘在水边劳作时的窈窕身影。难耐的相思之苦已达到了长夜不眠的程度。第三章八句突然出现了“琴瑟友之”“钟鼓乐之”的欢快、热闹的场面。这是个戏剧性的转变。幻由情生，这无疑是这位害相思之苦的男子对未来的设想，是他寤寐求其实现的愿望。 全诗共5个小节，结构形式是怎样的？明确:第一章(第1节)，描写小伙子见到一位漂亮的姑娘，从而引起的爱慕的感情和求婚的愿望。第二章(第2、3节)，描写小伙子求婚，苦于无法，求之不得，因而朝思暮想，寝食不安的苦恋情形。第三章(第4、5节)，描写小伙子结婚成梦，梦想成婚的欢乐场景。 主旨探究 《关雎》这首诗表达了怎样的主题？明确:《关雎》写了一个男子对一个女子的思念、追求过程，表达他求之不得的痛苦和求而得之的喜悦之情。 《诗经》的主要艺术表现手法有赋、比、兴等，《关雎》这首诗主要运用了什么手法？运用这种手法起到了什么作用？明确:《关雎》这首诗主要运用了“兴”的艺术手法。如本诗开头“关关雎鸠，在河之洲”，它原是诗人借眼前景物发端的话，但水鸟和鸣，也可以喻男女求偶，或男女间和谐恩爱。和下文“窈窕淑女，君子好逑”意义上发生关联。本诗的起兴之妙正在于诗人情趣与自然景物浑然一体的契合，也即一直为人们所乐道的情景交融的艺术境界。 《关雎》这首诗的各节，不仅句数相等，而且语言几乎完全相同，中间只变动几个字，甚至只变动一两个字，这就叫重章叠咏。运用这种方式表达情感，有什么作用？明确:重章叠咏形式的运用，对深化意境，渲染气氛，强化感情，突出主题都起到了很重要的作用。同时，它还有效地增强了诗歌的节奏感、音乐感，形成了一种回环往复之美，带给人一种委婉而深长的韵味。 板书设计关雎托物起兴所听：关关雎鸠所见：在河之洲所思：窈窕淑女所愿：琴瑟友之钟鼓乐之欢快热闹","link":"/2022-05-04-%E6%95%99%E6%A1%889.html"}],"tags":[{"name":"教案","slug":"教案","link":"/tags/%E6%95%99%E6%A1%88/"},{"name":"算法","slug":"算法","link":"/tags/%E7%AE%97%E6%B3%95/"},{"name":"实用工具","slug":"实用工具","link":"/tags/%E5%AE%9E%E7%94%A8%E5%B7%A5%E5%85%B7/"}],"categories":[{"name":"算法","slug":"算法","link":"/categories/%E7%AE%97%E6%B3%95/"},{"name":"题解","slug":"题解","link":"/categories/%E9%A2%98%E8%A7%A3/"}]}